---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrMonolithicStairs
source: html/9a562bf4-7a37-a275-b506-d568770aada0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrMonolithicStairs Property

"Monolithic Stairs"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrMonolithicStairs { get; }
```